In [ ]:
import pandas as pd
import numpy as np

data = {
    "name": ["Alice", "Bob", "Charlie", None, "Eva", "Frank", "Grace", "Henry", None, "Ivy"],
    "department": ["IT", "HR", "IT", "Marketing", "Finance", "IT", "HR", "Marketing", "Finance", "IT"],
    "role": ["Developer", "Recruiter", "Data Scientist", "Content Manager", "Accountant", "Backend Developer", "HR Manager", "SEO Specialist", "Financial Analyst", "Frontend Developer"],
    "experience": [3, 5, 2, 4, 6, 3, 7, 2, 5, 1],
    "salary": [70000, 60000, 75000, 55000, 80000, 72000, 65000, 50000, 78000, 68000],
    "score": [85, 90, 88, 92, np.nan, 87, 91, 84, 89, np.nan]
}

df = pd.DataFrame(data)

print(df)

      name   department                role  experience  salary  score
0    Alice  Engineering           Developer           3   70000   85.0
1      Bob           HR           Recruiter           5   60000   90.0
2  Charlie  Engineering      Data Scientist           2   75000   88.0
3      NaN    Marketing     Content Manager           4   55000   92.0
4      Eva      Finance          Accountant           6   80000    NaN
5    Frank  Engineering   Backend Developer           3   72000   87.0
6    Grace           HR          HR Manager           7   65000   91.0
7    Henry    Marketing      SEO Specialist           2   50000   84.0
8      NaN      Finance   Financial Analyst           5   78000   89.0
9      Ivy  Engineering  Frontend Developer           1   68000    NaN

In [3]:
df.groupby("department")["salary"].mean()

department
Engineering    71250.0
Finance        79000.0
HR             62500.0
Marketing      52500.0
Name: salary, dtype: float64

In [4]:
df.groupby("role")["score"].mean()

role
Accountant             NaN
Backend Developer     87.0
Content Manager       92.0
Data Scientist        88.0
Developer             85.0
Financial Analyst     89.0
Frontend Developer     NaN
HR Manager            91.0
Recruiter             90.0
SEO Specialist        84.0
Name: score, dtype: float64

In [5]:
df.groupby("department")["score"].count()

department
Engineering    3
Finance        1
HR             2
Marketing      2
Name: score, dtype: int64

In [6]:
df.groupby("department").size()

department
Engineering    4
Finance        2
HR             2
Marketing      2
dtype: int64

In [7]:
df.groupby("department")["salary"].agg(["mean","max","min","count"])

                mean    max    min  count
department
Engineering  71250.0  75000  68000      4
Finance      79000.0  80000  78000      2
HR           62500.0  65000  60000      2
Marketing    52500.0  55000  50000      2

In [8]:
df.groupby("role")["score"].agg(["mean","max","min","count"])

                    mean   max   min  count
role
Accountant           NaN   NaN   NaN      0
Backend Developer   87.0  87.0  87.0      1
Content Manager     92.0  92.0  92.0      1
Data Scientist      88.0  88.0  88.0      1
Developer           85.0  85.0  85.0      1
Financial Analyst   89.0  89.0  89.0      1
Frontend Developer   NaN   NaN   NaN      0
HR Manager          91.0  91.0  91.0      1
Recruiter           90.0  90.0  90.0      1
SEO Specialist      84.0  84.0  84.0      1

In [9]:
df.groupby(["department","role"])["salary"].mean()

department   role
Engineering  Backend Developer     72000.0
             Data Scientist        75000.0
             Developer             70000.0
             Frontend Developer    68000.0
Finance      Accountant            80000.0
             Financial Analyst     78000.0
HR           HR Manager            65000.0
             Recruiter             60000.0
Marketing    Content Manager       55000.0
             SEO Specialist        50000.0
Name: salary, dtype: float64

In [10]:
df.groupby(["department","experience"])["score"].mean()

department   experience
Engineering  1              NaN
             2             88.0
             3             86.0
Finance      5             89.0
             6              NaN
HR           5             90.0
             7             91.0
Marketing    2             84.0
             4             92.0
Name: score, dtype: float64